{
    "financial_health": {
        "question": "Assess the company's financial health based on the content of the annual report. Consider factors such as revenue growth, profit margins, debt level, cash flow, etc. Analyze whether the company's financial situation is stable and whether there are potential risks. Give a score of 1-10 (10 points are the best) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "business_model": {
        "question": "Based on the content of the annual report, analyze the company's business model and competitive advantages. What is the company's core business? What is its competitive position in the industry? Does the company have a continuous competitive advantage? Give a rating of 1-10 (10 points are the best) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "future_growth": {
        "question": "Based on the content of the annual report, evaluate the company's future growth potential. In which areas does the company invest? What are the market prospects? What are the growth drivers? Give a 1-10 rating (10 points are the best) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "management_quality": {
        "question": "Based on the content of the annual report, evaluate the quality of the company's management. Is the strategic decisions of the management reasonable? How is the execution ability? Is there good corporate governance? Give a 1-10 rating (10 points are the best) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "risk_assessment": {
        "question": "Based on the content of the annual report, evaluate the main risks faced by the company. It includes market risks, operating risks, financial risks, legal and compliance risks, etc. How serious are these risks? Is the company's measures to deal with risks adequate? Give a score of 1-10 (1 point means extremely high risk, 10 points means extremely low risk) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "industry_outlook": {
        "question": "Based on the content of the annual report, analyze the prospects of the company's industry. What are the development trends of the industry? What are the opportunities and challenges? How is the company's positioning in the industry? Give a rating of 1-10 (10 points are the best) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "esg_performance": {
        "question": "Based on the content of the annual report, evaluate the company's performance in environmental, social and governance (ESG). Does the company have a sustainable development strategy? How does social responsibility perform? Is the corporate governance structure sound? Give a 1-10 rating (10 points are the best) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "innovation_capability": {
        "question": "Based on the content of the annual report, evaluate the company's innovation capabilities. How is the company's investment in R&D? What are its innovative achievements? What impact does innovation have on the company's business? Give a 1-10 score (10 points are the best) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "investment_recommendation": {
        "question": "Based on the content of the annual report and the above analysis, investment advice on the company's stock is given. Consider the company's fundamentals, valuation level, growth prospects and risk factors. Is your suggestion strongly buying, buying, holding, selling or selling? Please explain the reasons in detail.",
        "type": "categorical",
        "categories": ["Sell strongly", "Sell", "Hold", "Buy strongly"]
    },
    "market_competition": {
        "question": "Based on the content of the annual report, analyze the company's competitive trend in the market. What are the main competitors? What are the advantages and disadvantages of the company compared with its competitors? How does the market share change? Give a 1-10 score (10 points represent a strong competitive advantage) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "financial_transparency": {
        "question": "Based on the content of the annual report, evaluate the transparency and quality of the company's financial information. What is the integrity and clarity of the financial statements? Are there any inadequate or ambiguity of information disclosure? Is there any risk of financial fraud in the company? Give a 1-10 score (10 points represent extremely high transparency) and explain the reasons in detail.",
        "type": "numeric",
        "score_range": [1, 10]
    }
}
