{
    "financial_health": {
        "question": "Analyze the company's financial health based on the content of the annual report. Consider factors such as revenue growth, profit margins, debt level, cash flow, and liquidity ratios. Is the company financially stable? Are there any concerning trends? Provide a comprehensive assessment and score from 1-10 (10 being excellent financial health).",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "business_model": {
        "question": "Analyze the company's business model and competitive advantages based on the annual report. What is the company's core business? What are its primary revenue streams? Does it have sustainable competitive advantages or moats? Assess its competitive position in the industry and provide a score from 1-10 (10 being strongest business model).",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "future_growth": {
        "question": "Based on the annual report content, evaluate the company's future growth potential. Consider investments in new products/services, R&D spending, market expansion plans, and growth strategy. What are the key growth drivers and opportunities? Score the growth potential from 1-10 (10 being highest growth potential).",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "management_quality": {
        "question": "Assess the quality of the company's management team based on the annual report. Consider their strategic decisions, execution ability, communication transparency, and corporate governance. Does management have a clear vision? How well are they delivering on previous commitments? Score management quality from 1-10 (10 being excellent).",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "risk_assessment": {
        "question": "Identify and evaluate the main risks faced by the company as disclosed in the annual report. Consider market risks, operational risks, financial risks, regulatory/legal risks, and any company-specific risks. How severe are these risks? How effectively is the company managing them? Provide a risk rating from 1-10 (1 being extremely high risk, 10 being very low risk).",
        "type": "numeric", 
        "score_range": [1, 10]
    },
    "industry_outlook": {
        "question": "Based on information in the annual report, analyze the outlook for the company's industry. What industry trends are mentioned? What competitive dynamics are at play? Are there structural changes occurring? How well-positioned is the company within its industry? Score the industry outlook from 1-10 (10 being most favorable).",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "esg_performance": {
        "question": "Evaluate the company's Environmental, Social and Governance (ESG) performance based on the annual report. Consider environmental initiatives, social responsibility programs, board diversity, and corporate governance structures. Does the company have meaningful sustainability targets? Score the ESG performance from 1-10 (10 being excellent).",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "innovation_capability": {
        "question": "Assess the company's innovation capabilities based on the annual report. Consider R&D investments, patents, new product/service introductions, and technology adoption. Is innovation a strategic priority? What innovative achievements are highlighted? Score the innovation capability from 1-10 (10 being excellent).",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "investment_recommendation": {
        "question": "Based on your analysis of this annual report, what investment recommendation would you make for this company's stock? Consider the company's fundamentals, valuation indicators mentioned, growth prospects, and risk factors. Would you suggest Strong Sell, Sell, Hold, Buy, or Strong Buy? Explain your rationale.",
        "type": "categorical",
        "categories": ["Strong Sell", "Sell", "Hold", "Buy", "Strong Buy"]
    },
    "market_competition": {
        "question": "Analyze the competitive landscape described in the annual report. Who are the main competitors? What are the company's competitive advantages and disadvantages? How is market share trending? Is the company gaining or losing competitive ground? Score the company's competitive position from 1-10 (10 representing dominant market position).",
        "type": "numeric",
        "score_range": [1, 10]
    },
    "financial_transparency": {
        "question": "Evaluate the transparency and quality of the company's financial reporting based on the annual report. Consider the clarity and completeness of disclosures, consistency in accounting methods, and any noteworthy items from the auditor's report. Are there any red flags in how information is presented? Score the financial transparency from 1-10 (10 being highest transparency).",
        "type": "numeric",
        "score_range": [1, 10]
    }
}
